benchmarks/2023-Oct-01_134306/python-flask.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.20.0.200 (be patient)


Server Software:        Werkzeug/3.0.0
Server Hostname:        172.20.0.200
Server Port:            2000

Document Path:          /api/echo
Document Length:        92 bytes

Concurrency Level:      100
Time taken for tests:   4.460 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2570000 bytes
Total body sent:        2510000
HTML transferred:       920000 bytes
Requests per second:    2241.90 [#/sec] (mean)
Time per request:       44.605 [ms] (mean)
Time per request:       0.446 [ms] (mean, across all concurrent requests)
Transfer rate:          562.66 [Kbytes/sec] received
                        549.53 kb/s sent
                        1112.19 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       3
Processing:    13   44   4.2     44      95
Waiting:        1   33   4.2     33      84
Total:         13   44   4.2     44      96

Percentage of the requests served within a certain time (ms)
  50%     44
  66%     44
  75%     45
  80%     45
  90%     46
  95%     46
  98%     48
  99%     65
 100%     96 (longest request)