benchmarks/2023-Oct-01_134306/rust-axum.log
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.20.0.200 (be patient)


Server Software:        
Server Hostname:        172.20.0.200
Server Port:            2000

Document Path:          /api/echo
Document Length:        91 bytes

Concurrency Level:      100
Time taken for tests:   0.557 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      1990000 bytes
Total body sent:        2510000
HTML transferred:       910000 bytes
Requests per second:    17955.42 [#/sec] (mean)
Time per request:       5.569 [ms] (mean)
Time per request:       0.056 [ms] (mean, across all concurrent requests)
Transfer rate:          3489.38 [Kbytes/sec] received
                        4401.18 kb/s sent
                        7890.56 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   0.4      2       3
Processing:     1    3   2.8      3      33
Waiting:        0    3   2.8      2      32
Total:          2    6   2.6      5      34

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      5
  75%      6
  80%      6
  90%      6
  95%      6
  98%      6
  99%     30
 100%     34 (longest request)